{
	"About": "ChainLink’s reference price feeds rely on a set of trusted parties to provide asset prices to the Ethereum blockchain. ChainLink also offers a service that allows users to request alternate off-chain price data from trusted oracle providers or, alternatively, set up a network of oracles themselves. ChainLink provides free access to reference price feeds for the ETH/USD and BTC/USD pairs (as well as many others). These feeds rely on a set of 21 trusted parties to submit reference price data. The ETH/USD pair updates every 0.5% deviation in price and has a heartbeat of 2 hours. The BTC/USD pair updates every 1% deviation in price and also has a heartbeat of 2 hours. Unlike MakerDAO, ChainLink does not have a decentralized governance process to determine participating parties in its reference price feeds. ChainLink itself is responsible for adding/removing parties from the system, centralizing control of the reference oracles.\nChainLink allows application developers to run their own ChainLink node or request other off-chain data, but requires payment in the LINK token. LINK is an ERC-667 token that implements a custom function that allows for the transfer of data along with token transfers. This mechanism is used to query and transfer resulting data from ChainLink nodes to on-chain smart contracts. If an application developer wishes to query non-reference data using Chainlink, they can either run their own ChainLink node, or query one of ChainLink’s trusted nodes. Each node that is queried charges the requester a predetermined amount of LINK. Requesters can call multiple nodes to achieve the desired degree of decentralization, but are charged for each query they make.\nChainLink gives developers the option to run their own ChainLink node that responds to requests, but requires these developers to buy and send the LINK token to themselves for each request they make. ChainLink will also be establishing a whitelist for all on-chain reference price data (although it is currently free). The ChainLink organization will control all changes (additions/deletions) to this list.",
	"Used By": {
		"aave.png": "https://aave.com/",
		"bzx.png": "https://bzx.network/",
		"nexusmutual.png": "https://nexusmutual.io/",
		"synthetix.png": "https://www.synthetix.io/"
	},
	"Contract Addresses": {
		"ETH/USD": "https://etherscan.io/address/0xF79D6aFBb6dA890132F9D7c355e3015f15F3406F",
		"BTC/USD": "https://etherscan.io/address/0x9b4e2579895efa2b4765063310dc4109a7641129",
		"BAT/USD": "https://etherscan.io/address/0xF5fff180082d6017036B771bA883025c654BC93"
	},
	"Useful Links": {
		"Developer Documentation": "https://docs.chain.link/docs/decentralized-oracles-ethereum-mainnet",
		"Feed Data": "https://feeds.chain.link/"
	},
	"Pros": [
		"Reference price data is free to access",
		"Link nodes for custom data feeds; quick to setup",
		"Easy API for application developers"
	],
	"Cons": [
		"Reference price feeds require on-chain transactions from every participant",
		"Users must trust ChainLink's determined set of parties to provide the correct pricing data",
		"Trusted node list and reference data feed whitelists are controlled by ChainLink"
	]
}
