{
	"About": "MakerDAO uses a custom oracle managed by a group of 14 pseudonymous individuals and public organizations to determine asset prices and exchange rates for supported assets. The group of 14 participating feeds are determined by a DAO governance vote, and is subject to change.\nThe oracle itself consists of two modules, a broadcaster and relayer. Each feed runs a broadcaster which pulls asset prices, signs them with their private key, and broadcasts them through a secure network. A relayer monitors the broadcaster messages, ensures they are within a predetermined spread (1%), aggregates the data, and submits it to Ethereum as a single transaction. Before the Maker system updates with the new price, however, a time period enforced by the Oracle Security Module (OSM) must be waited. This ensures that new price values propagated by the system are not taken up until a specified time in the future.\nMaker does not have incentive structure for relayers or feeds, but have proposed one such model which would compensate feeds, relayers, and other participants for their contributions to the system. The current design also maintains a whitelist of specific addresses who can access the oracle’s data.",
	"Used By": {
		"tokensets.png": "https://tokensets.com",
		"dydx.png": "https://dydx.exchange/",
		"ddex.png" : "https://ddex.io"
	},
	"Contract Addresses": {
		"ETH/USD": "https://etherscan.io/address/0x81FE72B5A8d1A857d176C3E7d5Bd2679A9B85763",
		"BTC/USD": "https://etherscan.io/address/0xe0f30cb149faadc7247e953746be9bbbb6b5751f",
		"BAT/USD": "https://etherscan.io/address/0xB4eb54AF9Cc7882DF0121d26c5b97E802915ABe6"
	},
	"Useful Links": {
		"MakerDAO Price Feeds Page": "https://developer.makerdao.com/feeds",
		"GitHub": "https://github.com/makerdao/oracles-v2",
		"Blog Post": "https://blog.makerdao.com/introducing-oracles-v2-and-defi-feeds"
	},
	"Pros": [
		"Decentralized. Trusted feeds are determined through a decentralized governance process",
		"Usability. API access for whitelisted addresses"
	],
	"Cons": [
		"Slow. OSM (oracle security module) prevents price updates from being reflected immediately",
		"Semi-trusted. Users must trust a bounded set of parties to provide the correct pricing data"
	]
}
